Repository: parada3456/Miniproj_PHQ9
Catalog: lib/l10n/app_*.arb
Languages: th

# head
source: Depression Test PHQ-9
th: แบบทดสอบภาวะซึมเศร้า PHQ-9

# from
source: From : Mental Health America(MHA)
th: จาก มหาวิทยาลัยมหิดลคณะแพทยศาสตร์โรงพยาบาลรามาธิบดี

source: Next
th: ต่อไป

# welcome
source: Over the last 2 weeks, how often have you been bothered by any of the following problems?
th: ในช่วง 2 สัปดาห์ ที่ผ่านมา ท่านมีอาการดังต่อไปนี้ บ่อยแค่ไหน?

source: Home
th: หน้าหลัก

# type
source: Please type your name below
th: กรุณากรอกชื่อด้านล่าง

# q1
source: Little interest or pleasure in doing things
th: เบื่อ ทำอะไร ๆ ก็ไม่เพลิดเพลิน

# q2
source: Feeling down, depressed, or hopeless
th: ไม่สบายใจ ซึมเศร้า หรือท้อแท้

# q3
source: Trouble falling or staying asleep, or sleeping too much
th: หลับยาก หรือหลับ ๆ ตื่น ๆ หรือหลับมากไป

# q4
source: Feeling tired or having little energy
th: เหนื่อยง่าย หรือไม่ค่อยมีแรง

# q5
source: Poor appetite or overeating
th: เบื่ออาหาร หรือกินมากเกินไป

# q6
source: Feeling bad about yourself - or that you are a failure or have let yourself or your family down
th: รู้สึกไม่ดีกับตัวเอง คิดว่าตัวเองล้มเหลว หรือเป็นคนทำให้ตัวเอง หรือครอบครัวผิดหวัง

# q7
source: Trouble concentrating on things, such as reading the newspaper or watching television
th: สมาธิไม่ดีเวลาทำอะไร เช่น ดูโทรทัศน์ ฟังวิทยุ หรือทำงานที่ต้องใช้ความตั้งใจ

# q8
source: Moving or speaking so slowly that other people could have noticed Or the opposite - being so fidgety or restless that you have been moving around a lot more than usual
th: พูดหรือทำอะไรช้าจนคนอื่นมองเห็น หรือกระสับกระส่ายจนท่านอยู่ไม่นิ่งเหมือนเคย

# q9
source: Feeling down, depressed, or hopeless Thoughts that you would be better off dead, or of hurting yourself
th: คิดทำร้ายตนเอง หรือคิดว่าถ้าตาย ๆ ไปเสียคงจะดี

# a1
source: Not at all
th: ไม่เลย

# a2
source: Several Days
th: มีบางวันหรือไม่บ่อย

# a3
source: More than half the days
th: มีค่อนข้างบ่อย

# a4
source: Nearly everyday
th: มีเกือบทุกวัน

# ans1
source: Moderate Depression Suggest Based on your answers, living with these symptoms could be causing difficulty managing relationships and even the tasks of everyday life.
th: ท่านมีอาการซึมเศร้าระดับปานกลาง ข้อแนะนำการดูแล ควรพักผ่อนให้เพียงพอ นอนหลับให้ได้ 6-8 ชั่วโมง ออกกำลังกายสม่ำเสมอ ทำกิจกรรมที่ทำให้ผ่อนคลาย พบปะเพื่อนฝูง ควรขอคำปรึกษาช่วยเหลือจากผู้ที่ไว้วางใจ ไม่จมอยู่กับปัญหา มองหาหนทางคลี่คลาย หากอาการที่ท่านเป็นมีผลกระทบต่อการทำงานหรือการเข้าสังคม หรือหากท่านมีอาการระดับนี้มานาน 1-2 สัปดาห์แล้วยังไม่ดีขึ้น ควรพบแพทย์เพื่อรับการช่วยเหลือรักษา

# ans2
source: Mild Depression Suggest While your symptoms are not likely having a major impact on your life, it is important to monitor them.
th: ท่านมีอาการซึมเศร้าระดับเล็กน้อย ข้อแนะนำการดูแล ควรพักผ่อนให้เพียงพอ นอนหลับให้ได้ 6-8 ชั่วโมง ออกกำลังกายสม่ำเสมอ ทำกิจกรรมที่ทำให้ผ่อนคลาย พบปะเพื่อนฝูง และควรทำแบบประเมินอีกครั้งใน 1 สัปดาห์

# ans3
source: Moderately Severe Depression Suggest Based on your answers, living with these symptoms is causing difficulty managing relationships and even the tasks of everyday life.
th: ท่านมีอาการซึมเศร้าระดับรุนแรงค่อนข้างมาก ข้อแนะนำการดูแล ควรพบแพทย์เพื่อประเมินอาการและให้การรักษา ระหว่างนี้ควรพักผ่อนให้เพียงพอ นอนหลับให้ได้ 6-8 ชั่วโมง ออกกำลังกายเบาๆ ทำกิจกรรมที่ทำให้ผ่อนคลาย ไม่เก็บตัว และควรขอคำปรึกษาช่วยเหลือจากผู้ใกล้ชิด

# ans4
source: Severe Depression Suggest Based on your answers, these symptoms seem to be greatly interfering with your relationships and the tasks of everyday life.
th: ท่านมีอาการซึมเศร้าระดับรุนแรงมาก ข้อแนะนำการดูแล ต้องพบแพทย์เพื่อประเมินอาการและให้การรักษาโดยเร็ว ไม่ควรปล่อยทิ้งไว้

# ans5
source: Mild Depression Suggest Your results indicate that you have none, or very few symptoms of depression.
th: ท่านไม่มีอาการซึมเศร้าหรือมีก็เพียงเล็กน้อย ข้อแนะนำการดูแล ไม่จำเป็นต้องรักษา

# ttscore
source: Your Score is between
th: คะแนนของคุณอยู่ระหว่าง
